from time import sleep

def pause():
    sleep(1)
    print('.')
    sleep(1)
    print('..')
    sleep(1)
    print('...')


pause()
print(" - Хто тут, я погано бачу, але відчуваю сміливу людину.")
gender = input(" - ти хлопець чи дівчина ? \"x\" чи \"д\"")

while gender != "х" and gender != "д" and gender != 0:
    print(" - просто напиши \"x\" чи \"д\"")
    gender = input(" - ти хлопець чи дівчина ? \"x\" чи \"д\"")

name = input(" - Вітаю, хоробрий воїне! Як я можу до тебе звертатись? : ")
print(name, " - гарне ім`я, якщо зможеш здолати дракона")

if gender == "х" or gender == "Х":
    print(" - назву свого сина твоїм іменем!")
else:
    print(" - назву свою доньку твоїм іменем!")

choice = input(" - Готовий йти до лігва дракона? (так/ні):")

# перевірка (тільки "так" або "ні")
while choice != "ні" and choice != "так":
    print(" - Я тебе не зрозумів.")
    sleep(1)
    print(" - Питаю ще раз:")
    sleep(1)
    choice = input(" - Готовий йти до лігва дракона? (так/ні):")

if choice == "ні":
    choice2 = input(" - Можливо, краще спочатку поїсти перед довгим походом? (так/ні):")
    
    # перевірка (тільки "так" або "ні")
    while choice2 != "так" and choice2 != "ні":
        print(" - Я тебе не зрозумів.")
        sleep(1)
        print(" - Питаю ще раз:")
        sleep(1)
        choice2 = input(" - Можливо, краще спочатку поїсти перед довгим походом? (так/ні):")

    if choice2 == "так":
        print(" - Знаю я тут одну місцину, зараз дійдемо")
        pause()
        sleep(1)
        choice3 = input(" - Ось вона! Зачекай, а ти маєш декілька срібних? (так/ні):")
        
        # перевірка (тільки "так" або "ні")
        while choice3 != "так" and choice3 != "ні":
            print(" - Я тебе не зрозумів.")
            print(" - Питаю ще раз:")
            choice3 = input(" - Ти маєш декілька срібних? (так/ні):")

        if choice3 == "так":
            print(" - Чудово, поїмо і відразу підемо до лігву!")
            choice = "так" # повертаємось до головної лінії сюжету
        else:
            print(" - ну і за що нам годуватись ? Змарнували час. Повертаймо назад ! ")
            sleep(1)
            choice = "так" # повертаємось до головної лінії сюжету

    if choice2 == "ні":
        print(" - Я більше нічого не зможу тобі запропонувати, або йдемо тоді зараз разом,\nабо йдеш сам коли тобі заманеться.")
        solo = input("*..Йти самому = 1..*  /  *..Йти зараз вдвох = 2..*")
        
        while solo != "1" and solo != "2":
            print(" - Я тебе не зрозумів.")
            print(" - Питаю ще раз:")
            solo = input("*..Йти самому = 1..*  /  *..Йти зараз вдвох = 2..*")

        if solo == "1":
            print("Ви вирішили йти самому. Скоріше за все, це не найраціональніше рішення в вашому житті")
            print("Розпочинаємо похід!")
            pause()
            sleep(1)
            print("*...Вечоріє...*")
            pause()
            sleep(1)
            print(" - Ось воно! Лігво! Прийшов час зіткнутись з драконом!")
            sleep(2)
            print('*..Звуки взмаху меча..*')
            sleep(2)
            print('*..Звуки реву дракону..*')
            sleep(2)
            print("\nПЕРЕМОГА! ВИ ЗДОЛАЛИ ДРАКОНА В ДВОБОЇ!")
        if solo == "2":
            choice = "так"

if choice == "так":
    print(" - Ну, що ж. Йти нам декілька діб.. Тому вночі треба бути обережним..")
    print("Розпочинаємо похід!")
    pause()
    sleep(1)
    print("*...Вечоріє...*")
    print("Вибач, хоробрий", name, ", я вже дуже втомився..")
    choice4 = input(" - Давай тут заночуємо? (так/ні):")

    # перевірка (тільки "так" або "ні")
    while choice4 != "так" and choice4 != "ні":
        print(" - Я тебе не зрозумів.")
        print(" - Питаю ще раз:")
        choice4 = input(" - Давай тут заночуємо? (так/ні):")

    if choice4 == "так":
        print("Ви вирішили заночувати серед лісу.")
        pause()
        print("*..Ви загинули уві сні..*")
        pause()
        sleep(1)
        print("О ні! Хоробрий", name, "що сталось з вами? Здається, я бачив щось схоже на змію...")

    if choice4 == "ні":
        print("*..Ви вирішили не зупинятися в лісі і продовжили рух..*")
        pause()
        sleep(1)
        print("*..Світає..*")
        pause()
        print("Ось воно! Лігво! Прийшов час зіткнутись з драконом!")
        sleep(2)
        print('*..Звуки взмаху меча..*')
        sleep(2)
        print('*..Звуки взмаху топора..*')
        sleep(2)
        print('*..Звуки реву дракону..*')
        sleep(2)
        print("ПЕРЕМОГА! ВИ ЗДОЛАЛИ ДРАКОНА РАЗОМ З ДРУГОМ!")


