
# Квест - Втеча зі школи
print("Гра Втеча зі школи")
print("Правила: ")
print("Пиши все після one і two")
print("Гра російською.")
print("Ось і всі правила, починай! ;)")
one = "Залишитися в класі"
two = "Втекти"
print("one = Залишитися в класі")
print("two = Втекти")
troll = input("Вчителька пішла, це хороший шанс для втечі. Як тобі вчинити?")
if troll == two:
    print("Ти вийшов із класу, ти знаєш, що твої однокласники розкажуть про тебе і за тобою почнуть стежити, але це не важливо, головне, не потрапити на очі.")
    one = "Сховатись"
    two = "Іти далі"
    print("one = Сховатись")
    print("two = Іти далі")
    troll2 = input("Тобі вдалося піти з класу. Перед тобою стоїть вчителька. Що ти зробиш?")
    while troll2 == two:
        print("О ні, тебе повела вчителька до директора. Витрачено.")
        print("one = Сховатись")
        print("two = Іти далі")
        one = "Сховатись"
        two = "Іти далі"
        troll2 = input("Тобі вдалося піти з класу. Перед тобою стоїть вчителька. Що ти зробиш?")
    print("Ти сховався. Так, вона тебе не помітила")
    one = "Тікати"
    two = "Тихо йти"
    print("one = Бігти")
    print("two = Тихо йти")
    troll3 = input("Вибери, як тобі йти.")
    while troll3 == one:
        print("Ти дуже сильно нашумів і вчителька російської мови вийшла з класу подивитися, що це таке. Вона помічає і відводить тебе на урок. Витрачено")
        one = "Тікати"
        two = "Тихо йти"
        print("one = Бігти")
        print("two = Тихо йти")
        troll3 = input("Вибери, як тобі йти.")
    print("Ти тихо пройшов. Тебе ніхто не помітив")
    one = "Віддаси всі гроші"
    two = "Втекти"
    print("one = Віддаси всі гроші")
    print("two = Втекти")
    troll4 = input("Перед тобою знаходиться банда прогульників. Вони тебе помітили і вимагають із тебе гроші. У тебе 100 рублів. Що ти зробиш?")
    while troll4 == two:
        print("Ти від них біжиш, а вони швидкі. Вони у тебе на хвості ІІІІ БУМ вони врізаються біля дверей математичного класу. Ти дивишся на них, але ззаду тебе стояв учитель і тепер відводить тебе на урок. Витрачено.")
        one = "Віддаси всі гроші"
        two = "Втекти"
        print("one = Віддаси всі гроші")
        print("two = Втекти")
        troll4 = input("Перед тобою знаходиться банда прогульників. Вони тебе помітили і вимагають у тебе гроші. У тебе 100 рублів. Що ти зробиш?")
    if troll4 == one:
        print("Ти віддав їм усі гроші.")
        print("Тепер не вийде нічого купити :(.")
        print("Ну й гаразд")
        print("Ти сходиш сходами з третього поверху. На щастя, там нікого нема. Спуск з другого поверху в іншому кінці школи.")
        one = "Зачекаєш"
        two = "Пройдеш і спробуєш не потрапити їм на очі"
        three = "Здаєшся і підеш до себе в клас"
        print("one = Почекай")
        print("two = Пройдеш і спробуєш не потрапити їм на очі")
        print("three = Здасися і уй")
        troll5 = input("У коридорі біля сходів стоїть 3 вчительки. Що ти зробиш?")
        while troll5 == two:
            print("Це була погана ідея(Вони тебе помітили). І повели до класу. Витрачено")
            one = "Зачекаєш"
            two = "Пройдеш і спробуєш не потрапити їм на очі"
            three = "Здаєшся і підеш до себе в клас"
            print("one = Почекай")
            print("two = Пройдеш і спробуєш не потрапити їм на очі")
            print("three = Здасися і підеш до себе в клас")
            troll5 = input("У коридорі біля сходів стоїть 3 вчительки. Що ти зробиш?")
        if troll5 == one:
            print("Учительки розійшлися по класах.")
            print("Тепер можна пробратися через коридор.")
            print("Ти йдеш до сходів і сходиш по ній. Ти виходиш на вулицю.")
            print("Ти пройшов гру, звичайно, без грошей, ну це не важливо. Важливо те, що ти пройшов гру.")
            print("Кінець.")
        else:
            print("Ти здався. Ти йдеш у клас і помічаєш, що вчительки ще немає.")
            print("Тобі дуже пощастило :).")
            print("Кінець.")
else:
    print("Ти залишився в класі.")
    print("Тобі залишилося дорішати 3 приклади.")
    print("Давай дорішаємо ці приклади.")
    answer1 = 651
    question1 = int(input("Скільки буде 153 + 498?"))
    while question1 != answer1:
        print("Не правильно, спробуй ще.")
        question1 = int(input("Скільки буде 153 + 498?"))
    print("Правильно!")
    print("Наступний приклад.")
    answer2 = 51
    question2 = int(input("Скільки буде 17 * 3"))
    while question2 != answer2:
        print("Не правильно, спробуй ще")
        question2 = int(input("Скільки буде 17 * 3"))
    print("Правильно!")
    print("Останній приклад.")
    answer3 = 586
    question3 = int(input("Скільки буде 1172/2"))
    while question3 != answer3:
        print("Не правильно, спробуй ще.")
        question3 = int(input("Скільки буде 1172/2"))
    print("Правильно")